[
  {
    "file": "experiments/cloud.js",
    "name": "cloud",
    "description": "it is an experiment cloud for final project"
  },
  {
    "file": "experiments/mountain_01.js",
    "name": "mountain landscape using perling noise",
    "description": "I used perlin noises for the birds and the mountains, This is an Asian mountain landscape in water color style, I would like to create a peaceful feeling. Future possible steps might be have Chinese letters writing, add peaceful music, let the bird fly."
  },
  {
    "file": "experiments/mountain_02.js",
    "name": "mountain landscape 2",
    "description": "It is a varation from mountain 1, now there is an animation of sunrise and sunset, the sky becomes darker when the mountains cover the sun, to increase the feeling of How Time Flies."
  },
  {
    "file": "experiments/mountain_03.js",
    "name": "mountain landscape 3",
    "description": "It is a varation from mountain 1, now there is an animation of sunrise and sunset, I create a fading trace behind the moving sun, and the birds are also have a slight movement, to increase the feeling of How Time Flies."
  },
  {
    "file": "experiments/mountain_04.js",
    "name": "mountain landscape 4",
    "description": "sound effect added, to create a ethereal feeling."
  },
  {
    "file": "experiments/molna_variation.js",
    "name": "perlin noise variation",
    "description": "I changed color to black and green from molna's example, and I also add mouse interative feature for it, the pattern changes depending on the mouse moving from left to right."
  },
  {
    "file": "experiments/oscillator_objects.js",
    "name": "oscillator objects variation",
    "description": "This is a varation from The Nature of Code's Oscillator Objects, it is a little meditative, shows stability and movement."
  },
  {
    "file": "experiments/gravitational_attraction.js",
    "name": "Gravitational attraction variation",
    "description": "The Element's movement toward the Attractor feels unstoppable, like a planet being pulled into orbit by a larger object. It draws a pattern would look like a bright, swirling vortex with a glowing center."
  },
  {
    "file": "experiments/flow_fields.js",
    "name": "Flow fields variation",
    "description": "The combination of the structured circle and the fluid, feel the associations with nature, gives a depressed feeling when it becomes darker."
  },
  {
    "file": "experiments/tree_01.js",
    "name": "nature_01",
    "description": "I use Daniel's The Nature of Code as a base, it is changing the position where the plant grows when people click"
  },
  {
    "file": "experiments/tree_02.js",
    "name": "nature_02",
    "description": "this is the variation from tree_01.js, I chose to make the showcase more random, looking organic and relaxing."
  },
  {
    "file": "experiments/tree_03.js",
    "name": "nature_03",
    "description": "there will be a plant growing in the canvas"
  }
]
